NextFOAM-2409/tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/system/filmRegion/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    f0;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (-1 -0.00001 -0.00001) (1 1.00001 0.00001);
    }

    {
        name    f1;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (-1 0.99999 -0.00001) (1 1.00001 2.00001);
    }

    {
        name    f2;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (-1 -0.00001 1.99999) (1 1.00001 2.00001);
    }

    {
        name    f3;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (-1 -0.00001 -0.00001) (1 0.00001 2.00001);
    }
);


// ************************************************************************* //
